#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.main: Refreshing state... [id=7f31af5a5c5aca80f5cef92c760bfaa464be5d6e]
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zY2QyMzZkOC1kMjc0LTQzNjEtYmVhNC0yZjJhOGFhODBiYjM7b2JqZWN0SWQ9YzNmZGQwN2MtYTI2OS00NDBmLWIxZmItOGE4ZGYxMmJkYWYyO3N1YnNjcmlwdGlvbklkPWU5YTA4Y2MwLWVlMGQtNDdmOS1iMzMwLWQzNmU5YjFmY2Q3Yjt0ZW5hbnRJZD0yYWY1YmE0OC0wZWYxLTQ1ODctODNiNS1iODZhNWY3YjBkYjU=]
data.azurerm_resource_group.example: Read complete after 1s [id=/subscriptions/e9a08cc0-ee0d-47f9-b330-d36e9b1fcd7b/resourceGroups/SWO-20221608-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/e9a08cc0-ee0d-47f9-b330-d36e9b1fcd7b/resourceGroups/SWO-20221608-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/e9a08cc0-ee0d-47f9-b330-d36e9b1fcd7b/resourceGroups/SWO-20221608-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/e9a08cc0-ee0d-47f9-b330-d36e9b1fcd7b/resourceGroups/SWO-20221608-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/e9a08cc0-ee0d-47f9-b330-d36e9b1fcd7b/resourceGroups/SWO-20221608-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/e9a08cc0-ee0d-47f9-b330-d36e9b1fcd7b/resourceGroups/SWO-20221608-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "example-machine-pr" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "608d7a49-6c07-4556-a03b-b96bba61d09b" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "example-machine_OsDisk_1_8d39879e17754615b13656f0b2afdb4f" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @SimenWO, Action: `pull_request`*